{
  "places": [
    {
      "id": 1,
      "name": "Bellevue Downtown Park",
      "description": "Lushly planted city park featuring a 240-foot-wide waterfall, a picnic green & a playground. Perfect for family outings with wide open spaces, peaceful walking paths, and the famous Inspiration Playground designed for all abilities.",
      "features": ["Outdoor", "Free", "Playground", "Walking Paths", "Waterfall", "Picnic Areas"],
      "ageRange": [6, 96],
      "icon": "🌲",
      "address": "10201 NE 4th St, Bellevue, WA 98004",
      "phone": "(425) 452-6885",
      "website": "https://parks.bellevuewa.gov/parks-and-trails/parks/bellevue-downtown-park/",
      "pricing": "Free",
      "parkingInfo": "Free parking available in multiple lots including Southern Parking Lot",
      "durationOfVisit": "1-3 hours",
      "bestTimeToVisit": "Weekday mornings or late afternoons (less crowded)",
      "noiseLevel": "Quiet to moderate",
      "foodOptions": "Picnic areas available, bring your own food. Nearby restaurants in downtown Bellevue",
      "specialNotes": "Features the famous 240-foot waterfall, duck pond, and the Inspiration Playground. Dog-friendly with designated areas. Great for jogging, walking, or family picnics. Open 24 hours.",
      "yunsolExperience": {
        "hasVisited": true,
        "rating": 3,
        "likes": "The waterfall is mesmerizing for Yunsol! She could watch the ducks for hours and loves the Inspiration Playground.",
        "dislikes": "The walking paths can be long for little legs. Some areas get muddy after rain.",
        "personalNotes": "The duck pond is magical in the morning. Bring breadcrumbs (if allowed) and a stroller for the longer walks. The playground is perfect for her age group - safe but challenging!"
      }
    }
  ],
  "tips": [
    {
      "id": 1,
      "icon": "🎒",
      "title": "Pack Smart",
      "description": "Always bring snacks, water, extra clothes, and favorite comfort items. A well-packed bag can save the day!"
    },
    {
      "id": 2,
      "icon": "⏰",
      "title": "Time It Right",
      "description": "Plan outings around nap times and meal schedules. Happy, well-rested toddlers make for better adventures!"
    },
    {
      "id": 3,
      "icon": "🛡️",
      "title": "Safety First",
      "description": "Research the venue beforehand, check for toddler-proofing, and always keep a close eye on your little explorer."
    },
    {
      "id": 4,
      "icon": "📋",
      "title": "Have a Backup Plan",
      "description": "Weather changes, meltdowns happen! Always have an indoor alternative or know when it's time to head home."
    }
  ]
}
