{
  "places": [
    {
      "id": 1,
      "name": "Bellevue Downtown Park",
      "description": "Lushly planted city park featuring a 240-foot-wide waterfall, a picnic green & a playground. Perfect for family outings with wide open spaces, peaceful walking paths, and the famous Inspiration Playground designed for all abilities.",
      "features": ["Outdoor", "Free", "Playground", "Nature"],
      "ageRange": [6, 96],
      "icon": "🌲",
      "address": "10201 NE 4th St, Bellevue, WA 98004",
      "phone": "(425) 452-6885",
      "website": "https://parks.bellevuewa.gov/parks-and-trails/parks/bellevue-downtown-park/",
      "pricing": "Free",
      "parkingInfo": "Free parking available in multiple lots including Southern Parking Lot",
      "durationOfVisit": "1-3 hours",
      "specialNotes": "Features the famous 240-foot waterfall, duck pond, and the Inspiration Playground. Dog-friendly with designated areas. Great for jogging, walking, or family picnics. Open 24 hours.",
      "yunsolExperience": {
        "hasVisited": true,
        "rating": 3,
        "likes": "The waterfall is mesmerizing for Yunsol! She could watch the ducks for hours and loves the Inspiration Playground.",
        "dislikes": "The walking paths can be long for little legs. Some areas get muddy after rain.",
        "personalNotes": "The duck pond is magical in the morning. Bring breadcrumbs (if allowed) and a stroller for the longer walks. The playground is perfect for her age group - safe but challenging!"
      }
    },
    {
      "id": 2,
      "name": "Great Wolf Lodge Water Park",
      "description": "Indoor/outdoor water park resort with slides, pools, and activities designed for families. Features themed water attractions, arcade games, and on-site dining options perfect for a full day or weekend adventure.",
      "features": ["Indoor", "Water", "Entertainment"],
      "ageRange": [12, 144],
      "icon": "🐺",
      "address": "20500 Old Hwy 99 SW, Centralia, WA 98531",
      "phone": "(800) 640-9653",
      "website": "https://www.greatwolf.com/grand-mound",
      "pricing": "$$$",
      "parkingInfo": "Paid parking available on-site for resort guests and day pass visitors",
      "durationOfVisit": "4-8 hours (or overnight stay)",
      "specialNotes": "3-star resort with water park access. Check-in 4:00 PM, Check-out 11:00 AM. LGBTQ+ friendly. Off I-5, 7 miles from Centralia Rollerdrome. Day passes available for water park access. Multiple restaurants on-site including Lodge Wood Fired Grill and buffet options.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Perfect for toddlers who love water! Indoor water park means weather won't affect plans. Consider staying overnight for the full experience."
      }
    },
    {
      "id": 3,
      "name": "Tukwila Family Fun Center & Bullwinkle's Restaurant",
      "description": "Amusement park with go-karts, bumper boats, mini-golf & many other activities, plus pizza & burgers. Perfect for active toddlers and families looking for diverse entertainment options.",
      "features": ["Indoor", "Entertainment", "Food"],
      "ageRange": [18, 144],
      "icon": "🎮",
      "address": "7300 Fun Center Way, Tukwila, WA 98188",
      "phone": "(425) 228-7300",
      "website": "http://www.bullwinkles.com/tukwila",
      "pricing": "$$",
      "parkingInfo": "Free parking available on-site with large parking lot",
      "durationOfVisit": "2-4 hours",
      "specialNotes": "Wristbands available for multiple activities. Value packages starting at $60. Open 11 AM Thu. Features go-karts, laser tag, bowling, mini golf, and arcade. On-site restaurant with kid-friendly menu. Great for birthday parties and group events.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Lots of activities under one roof - perfect for energetic toddlers! Check height requirements for go-karts. The arcade will definitely be a hit!"
      }
    },
    {
      "id": 4,
      "name": "Gene Coulon Memorial Beach Park",
      "description": "Public 57-acre lakeside park offering boat launches, a walking trail, tennis courts & picnic areas. Features a beautiful mile-long walkway along Lake Washington with amazing sunset views.",
      "features": ["Outdoor", "Free", "Water", "Playground"],
      "ageRange": [6, 96],
      "icon": "🏖️",
      "address": "1201 Lake Washington Blvd N, Renton, WA 98056",
      "phone": "(425) 430-6700",
      "website": "https://www.rentonwa.gov/Activities-Events/Parks-and-Trails/Gene-Coulon-Memorial-Beach-Park",
      "pricing": "Free",
      "parkingInfo": "Free parking available but can be limited during peak times. Multiple parking areas including boat launch parking",
      "durationOfVisit": "1-4 hours",
      "specialNotes": "Open 8 AM daily. Features mile-long lakeside walkway, swimming area with beach, volleyball courts, tennis courts, BBQ grills, boat launch and docks. On-site restaurants include Ivar's Seafood Bar and Kidd Valley. Spectacular sunset views. Well-maintained with restrooms and picnic facilities.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "The walking path along the lake is perfect for strollers! Swimming area and playground will keep Yunsol busy. Great spot for family picnics with restaurant options nearby."
      }
    },
    {
      "id": 5,
      "name": "Westfield Southcenter",
      "description": "2-level indoor shopping mall with more than 200 stores & eateries plus a multiplex with IMAX. Perfect for rainy days with kid-friendly activities and diverse dining options.",
      "features": ["Indoor", "Shopping", "Food", "Entertainment"],
      "ageRange": [6, 144],
      "icon": "🛍️",
      "address": "2800 Southcenter Mall, Seattle, WA 98188",
      "phone": "(206) 246-0423",
      "website": "https://www.westfield.com/en/united-states/southcenter",
      "pricing": "$",
      "parkingInfo": "Free huge parking lots with multiple levels and easy access",
      "durationOfVisit": "2-5 hours",
      "specialNotes": "Open 10 AM daily. Features movie theater with IMAX, extensive food court with Asian cuisine, and kids' car rides on the second floor. Over 200 stores including major department stores. Climate-controlled environment perfect for any weather. Wide hallways and wheelchair accessible.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Great backup plan for rainy days! The kids' car rides will be a hit with Yunsol. Food court has lots of options, and it's perfect for shopping while keeping little ones entertained."
      }
    },
    {
      "id": 6,
      "name": "Newcastle Beach Park",
      "description": "This grassy park has a beach with docks & lifeguards, restrooms, picnic tables & a play area. Beautiful location with clean sand, clear water, and stunning sunset views.",
      "features": ["Outdoor", "Free", "Water", "Playground"],
      "ageRange": [6, 96],
      "icon": "🏖️",
      "address": "4400 Lake Washington Blvd SE, Bellevue, WA 98006",
      "phone": "(425) 452-6914",
      "website": "https://parks.bellevuewa.gov/parks-and-trails/parks/newcastle-beach-park/",
      "pricing": "Free",
      "parkingInfo": "Limited parking spaces available, can fill up quickly during peak times",
      "durationOfVisit": "2-4 hours",
      "specialNotes": "Open 6 AM daily. Features lifeguarded swimming area, fishing pier, picnic sites, and playground. Note: Swimming may be restricted due to water quality (bacteria levels). Dog-friendly with leash requirements. Beautiful sunset views and calm atmosphere perfect for family relaxation.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Beautiful beach setting with playground! Check water quality before planning to swim. The calm atmosphere and sunset views make it perfect for peaceful family time."
      }
    },
    {
      "id": 7,
      "name": "Lake Boren Park",
      "description": "Local park with walking paths, a kids' play area, picnic shelters, a fishing dock & athletic courts. Well-maintained grounds with lots of open space and activities for all ages.",
      "features": ["Outdoor", "Free", "Playground", "Sports"],
      "ageRange": [6, 96],
      "icon": "🏞️",
      "address": "13058 SE 84th Way, Newcastle, WA 98056",
      "phone": "(425) 649-4444",
      "website": "http://www.newcastlewa.gov/cms/One.aspx?portalId=4026119&pageId=4484229",
      "pricing": "Free",
      "parkingInfo": "Free on-site parking available with good accessibility",
      "durationOfVisit": "1-3 hours",
      "specialNotes": "Open 8 AM daily. Features tennis courts, basketball courts, pickleball courts, volleyball court, fishing pier, and playground equipment suitable for various ages including climbing wall. Dog-friendly with leash requirements. Safer alternative to larger lakeside parks with well-maintained facilities and family-friendly atmosphere.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Great variety of activities in one place! The playground with climbing wall will challenge Yunsol, and the open spaces are perfect for running around. Feels safer and more contained than bigger parks."
      }
    },
    {
      "id": 8,
      "name": "Marymoor Park",
      "description": "684-acre park featuring a spacious off-leash dog area, climbing wall, soccer fields & concerts. Perfect for families with pets and outdoor enthusiasts seeking diverse activities.",
      "features": ["Outdoor", "Free", "Sports", "Entertainment"],
      "ageRange": [6, 144],
      "icon": "🐕",
      "address": "6046 West Lake Sammamish Pkwy NE, Redmond, WA 98052",
      "phone": "(206) 477-7275",
      "website": "https://www.kingcounty.gov/services/parks-recreation/parks/parks-and-natural-lands/popular-parks/marymoor.aspx",
      "pricing": "Free",
      "parkingInfo": "Smart parking arrangements with multiple lots available. Food trucks often present",
      "durationOfVisit": "2-6 hours",
      "specialNotes": "Open 24 hours. Features Jerry Baker Memorial Velodrome, climbing wall, and concert venue. Largest off-leash dog park in the area. Popular for concerts, cycling, and family activities. Food trucks available (tacos, BBQ, cupcakes, ice cream). Peak times 5-8 PM.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Huge open space perfect for running around! The climbing wall will be exciting for Yunsol. Dog park means lots of friendly dogs to see, but keep close watch."
      }
    },
    {
      "id": 9,
      "name": "Meydenbauer Bay Park",
      "description": "This 2.5-acre beach offers in-season swimming plus a fishing dock & play/picnic areas. Beautiful waterfront location with stunning sunset views and family amenities.",
      "features": ["Outdoor", "Free", "Water", "Playground"],
      "ageRange": [6, 96],
      "icon": "🌅",
      "address": "419 98th Ave NE, Bellevue, WA 98004",
      "phone": "(425) 452-6885",
      "website": "https://bellevuewa.gov/city-government/departments/parks/parks-and-trails/parks/meydenbauer-beach-park",
      "pricing": "Free",
      "parkingInfo": "Free on-site parking available",
      "durationOfVisit": "2-4 hours",
      "specialNotes": "Open 7 AM-11 PM daily. Features lifeguarded swimming area (seasonal), fishing pier, and playground. Family bathrooms with changing areas available. Perfect for sunset viewing, kayaking, and water activities. Beach access for swimming and water play.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Beautiful sunset spot! Swimming area will be perfect for Yunsol in summer. The playground right by the water is ideal for keeping kids entertained."
      }
    },
    {
      "id": 10,
      "name": "Wilburton Hill Park",
      "description": "Wooded park with picnic areas, a soccer field & 2 baseball fields, a playground & trails. Adjacent to the beautiful Bellevue Botanical Garden for extended exploration.",
      "features": ["Outdoor", "Free", "Playground", "Nature"],
      "ageRange": [6, 96],
      "icon": "🌸",
      "address": "12400 Main St, Bellevue, WA 98005",
      "phone": "(425) 452-6914",
      "website": "https://bellevuewa.gov/city-government/departments/parks",
      "pricing": "Free",
      "parkingInfo": "Abundant free parking available with good accessibility",
      "durationOfVisit": "2-5 hours",
      "specialNotes": "Open 6:30 AM daily. Features fenced dog park, breathtaking bridge over babbling brook, and trails with steady uphill inclines. Adjacent to Bellevue Botanical Garden with seasonal Garden d'Lights display. Clean restrooms and well-maintained facilities.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "The bridge will be exciting for Yunsol! Combined with the botanical garden, this could be a full day adventure. Great for nature walks and discovering plants."
      }
    },
    {
      "id": 11,
      "name": "Bellevue Square",
      "description": "Sprawling venue that includes retail shops, casual & upscale dining options & a comedy club. Upscale shopping destination with family amenities and entertainment.",
      "features": ["Indoor", "Shopping", "Food", "Entertainment"],
      "ageRange": [12, 144],
      "icon": "🏬",
      "address": "575 Bellevue Square, Bellevue, WA 98004",
      "phone": "(425) 454-8096",
      "website": "http://bellevuecollection.com/",
      "pricing": "$$",
      "parkingInfo": "Free parking with valet parking options available",
      "durationOfVisit": "2-4 hours",
      "specialNotes": "Open 10 AM daily. High-end shopping with Tesla store, Tommy Bahama, and Macy's. Children's play area available. Concierge services and well-maintained restrooms at every corner. Comedy club for evening entertainment.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Great for rainy day backup! The children's play area will keep Yunsol busy while shopping. Lots of dining options when she gets hungry."
      }
    },
    {
      "id": 12,
      "name": "Killarney Glen Park",
      "description": "Compact, wooded community park with tennis courts, basketball hoops, picnic areas & a playground. Hidden gem just minutes from downtown Bellevue with peaceful trails.",
      "features": ["Outdoor", "Free", "Playground", "Sports"],
      "ageRange": [6, 96],
      "icon": "🏀",
      "address": "1933 104th Ave SE, Bellevue, WA 98004",
      "phone": "(425) 452-6914",
      "website": "https://bellevuewa.gov/city-government/departments/parks/parks-and-trails/parks/killarney-glen-park",
      "pricing": "Free",
      "parkingInfo": "Limited on-site parking available",
      "durationOfVisit": "1-2 hours",
      "specialNotes": "Small but well-maintained park perfect for quick visits. Features tennis courts, basketball courts, and short walking trails among majestic trees. Very quiet and peaceful atmosphere. Note: Only portable restrooms available.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Perfect for a quick play session! The wooded setting feels magical and the playground is just the right size for Yunsol's age."
      }
    },
    {
      "id": 13,
      "name": "Chism Beach Park",
      "description": "Beautiful serene park in SE Bellevue with a beautiful beach and a playground for kids. More secluded location with tons of shade and peaceful atmosphere.",
      "features": ["Outdoor", "Free", "Water", "Playground"],
      "ageRange": [6, 96],
      "icon": "🏖️",
      "address": "9600 SE 11th St, Bellevue, WA 98004",
      "phone": "(425) 452-6885",
      "website": "https://bellevuewa.gov/city-government/departments/parks/parks-and-trails/parks/chism-beach-park",
      "pricing": "Free",
      "parkingInfo": "Lots of parking available with good accessibility",
      "durationOfVisit": "2-4 hours",
      "specialNotes": "Features lifeguarded swimming area, clean public restrooms, and historic Burrows Cabin. More secluded than other beach parks with excellent shade coverage. Popular for family picnics but tends to be busy - only one picnic table available.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "The secluded feel is perfect for peaceful family time! Swimming area with lifeguards makes it safe for Yunsol. The shade will be great on hot days."
      }
    },
    {
      "id": 14,
      "name": "Luther Burbank Park",
      "description": "Visitors swim, boat & fish at this 7-acre lakefront park with a playground, dog run & wetlands area. Historic park on Mercer Island with diverse activities and beautiful lake access.",
      "features": ["Outdoor", "Free", "Water", "Sports"],
      "ageRange": [6, 96],
      "icon": "🌊",
      "address": "2040 84th Ave SE, Mercer Island, WA 98040",
      "phone": "(206) 275-7609",
      "website": "https://www.mercerisland.gov/parksrec/page/luther-burbank-park",
      "pricing": "Free",
      "parkingInfo": "Ample free parking available with easy access",
      "durationOfVisit": "2-5 hours",
      "specialNotes": "Open 6 AM daily. Features Calkins Point Sand Beach, pickleball courts, and boardwalk trail. Year-round lake access for swimming and water activities. Community and event center on-site. Some areas may feel undermaintained according to recent reviews.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Sand beach will be amazing for Yunsol! The variety of activities means we can spend a whole day here. Boardwalk trail is perfect for stroller walks."
      }
    },
    {
      "id": 15,
      "name": "KidsQuest Children's Museum",
      "description": "Interactive educational exhibits staged indoors & outdoors, plus workshops & summer camps. Perfect hands-on learning environment designed specifically for children's exploration and discovery.",
      "features": ["Indoor", "Educational", "Entertainment"],
      "ageRange": [6, 120],
      "icon": "🧪",
      "address": "1116 108th Ave NE, Bellevue, WA 98004",
      "phone": "(425) 637-8100",
      "website": "https://www.kidsquestmuseum.org/",
      "pricing": "$",
      "parkingInfo": "Parking validation available at SalesForce building at 929 (confirmed by business)",
      "durationOfVisit": "2-4 hours",
      "specialNotes": "Open 9:30 AM daily. Admission $16.75. Features multiple themed rooms including tots room with tractor and vegetables, grocery store play area, train tracks, and climbing areas. Birthday party hosting available. Various activities for different age groups.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Perfect rainy day activity! The tots room sounds ideal for Yunsol's age. All the hands-on exhibits will keep her engaged and learning through play."
      }
    },
    {
      "id": 16,
      "name": "The Museum of Flight",
      "description": "Large educational museum with aircraft & space vehicles on display, plus historical exhibits. World-class aviation museum with impressive collection from historic warplanes to modern jets.",
      "features": ["Indoor", "Educational", "Transportation"],
      "ageRange": [18, 144],
      "icon": "✈️",
      "address": "9404 E Marginal Way S, Seattle, WA 98108",
      "phone": "(206) 764-5700",
      "website": "https://www.museumofflight.org/",
      "pricing": "$$",
      "parkingInfo": "On-site parking available",
      "durationOfVisit": "3-6 hours",
      "specialNotes": "Open 10 AM daily. Admission $26.00. Features Aviation Pavilion, Charles Simonyi Space Gallery, and Wings Café. LGBTQ+ friendly. Home to Air Force One, Concorde, and extensive aircraft collection. Gift shop and dining available on-site.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Airplanes will fascinate Yunsol! Great for inspiring interest in aviation and science. The large exhibits and interactive displays will capture her imagination."
      }
    },
    {
      "id": 17,
      "name": "Woodland Park Zoo",
      "description": "92-acre zoo with nearly 300 species, a vintage carousel, summer concerts & an indoor play space. Well-designed habitats that mimic natural environments for animals and families.",
      "features": ["Outdoor", "Animals", "Entertainment"],
      "ageRange": [6, 144],
      "icon": "🦁",
      "address": "5500 Phinney Ave N, Seattle, WA 98103",
      "phone": "(206) 548-2500",
      "website": "https://www.zoo.org/",
      "pricing": "$$",
      "parkingInfo": "On-site parking available, can be busy during peak times",
      "durationOfVisit": "4-8 hours",
      "specialNotes": "Open 9:30 AM daily. Admission $26.96. Features Zoomazium indoor play space, vintage carousel, and spacious animal enclosures. Summer concerts and special events. Food court and gift shops available. Interactive map with real-time location tracking.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Animals in natural habitats will be amazing for Yunsol! The indoor play space is perfect for breaks. Carousel ride will be a special treat!"
      }
    },
    {
      "id": 18,
      "name": "Washington Park Arboretum",
      "description": "On the shores of Lake Washington, this 230-acre preserve features rare trees & a Japanese garden. Beautiful botanical wonderland perfect for peaceful walks and nature education.",
      "features": ["Outdoor", "Free", "Nature", "Educational"],
      "ageRange": [6, 144],
      "icon": "🌳",
      "address": "2300 Arboretum Dr E, Seattle, WA 98112",
      "phone": "(206) 543-8800",
      "website": "https://botanicgardens.uw.edu/washington-park-arboretum/",
      "pricing": "Free",
      "parkingInfo": "Free parking available across the street with easy access",
      "durationOfVisit": "2-4 hours",
      "specialNotes": "Open 8 AM daily. Features Foster Point Trail, Arboretum Loop Trail, and Seattle Japanese Garden (separate admission). Great for walking, running, cycling, and kayaking. Playground available near parking area. Peak cherry blossom season is popular.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Free admission makes this perfect for frequent visits! The variety of trees and plants will spark Yunsol's curiosity about nature. Great for educational walks."
      }
    },
    {
      "id": 19,
      "name": "Pacific Science Center",
      "description": "Rotating science exhibits plus laser light shows, a tropical butterfly house & IMAX movie theaters. Interactive science museum designed to inspire curiosity and learning through hands-on exploration.",
      "features": ["Indoor", "Educational", "Entertainment"],
      "ageRange": [6, 144],
      "icon": "🔬",
      "address": "200 Sue Bird Ct N, Seattle, WA 98109",
      "phone": "(206) 443-2001",
      "website": "https://www.pacificsciencecenter.org/",
      "pricing": "$$",
      "parkingInfo": "Multiple parking options available in Seattle Center area",
      "durationOfVisit": "4-7 hours",
      "specialNotes": "Open 10 AM daily. Admission $27.45. Features IMAX theaters, Laser Dome, Tropical Butterfly House, and hands-on exhibits. Located in Seattle Center with easy access to other attractions. Maker space area and VR experiences available.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Perfect for curious minds! The butterfly house will be magical for Yunsol. Interactive exhibits mean she can touch and explore while learning about science."
      }
    },
    {
      "id": 20,
      "name": "Olympic Sculpture Park",
      "description": "An offshoot of the Seattle Art Museum, this park features numerous sculptures spread over 9 acres. Free outdoor art experience with stunning waterfront views and unique installations.",
      "features": ["Outdoor", "Free", "Art", "Nature"],
      "ageRange": [12, 144],
      "icon": "🎨",
      "address": "2901 Western Ave, Seattle, WA 98121",
      "phone": "(206) 654-3100",
      "website": "https://www.seattleartmuseum.org/visit/olympic-sculpture-park/",
      "pricing": "Free",
      "parkingInfo": "Limited street parking available, consider public transit",
      "durationOfVisit": "1-3 hours",
      "specialNotes": "Open 24 hours. Features Alexander Calder's The Eagle, Richard Serra's Wake, and PACCAR Pavilion. Stunning views of Seattle skyline, waterfront, and Olympic Mountains. Perfect for sunset viewing and art appreciation walks.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Free art experience with amazing views! The large sculptures will spark Yunsol's imagination. Perfect for short visits and introducing her to public art."
      }
    },
    {
      "id": 21,
      "name": "Seward Park",
      "description": "Wooded refuge boasting a 300-acre forest with hiking trails, walking paths, beaches & a playground. Large urban forest park with diverse ecosystems and family-friendly amenities.",
      "features": ["Outdoor", "Free", "Nature", "Playground"],
      "ageRange": [6, 144],
      "icon": "🌲",
      "address": "5900 Lake Washington Blvd S, Seattle, WA 98118",
      "phone": "(206) 684-4396",
      "website": "http://www.seattle.gov/parks/find/parks/seward-park",
      "pricing": "Free",
      "parkingInfo": "Parking lot available but can be busy during peak times",
      "durationOfVisit": "2-6 hours",
      "specialNotes": "Open 6 AM daily. Features Audubon Center, amphitheater, and multiple hiking trails. Swimming areas and beach access available. Popular for nature education and bird watching. Various trail difficulty levels available.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Huge forest in the city! Perfect for nature exploration and hiking with Yunsol. The Audubon Center will teach her about local wildlife and ecosystems."
      }
    },
    {
      "id": 22,
      "name": "Lake Sammamish State Park",
      "description": "512-acre park with ample waterfront access & boat launch, plus seasonal kayak rentals & picnicking. Beautiful state park with extensive beach access and family recreation opportunities.",
      "features": ["Outdoor", "Water", "Playground", "Sports"],
      "ageRange": [6, 144],
      "icon": "🏞️",
      "address": "2010 NW Sammamish Rd, Issaquah, WA 98027",
      "phone": "(425) 455-7010",
      "website": "http://parks.state.wa.us/533/Lake-Sammamish",
      "pricing": "$",
      "parkingInfo": "Parking available, Discover Pass required ($10)",
      "durationOfVisit": "3-8 hours",
      "specialNotes": "Open 6:30 AM daily. Discover Pass required. Features Sunset Beach, boat launch, and kayak rentals by Wheel Fun Rentals. Large grassy areas perfect for picnics. Well-maintained facilities with restrooms and boat washing station.",
      "yunsolExperience": {
        "hasVisited": false,
        "rating": 0,
        "likes": "",
        "dislikes": "",
        "personalNotes": "Amazing beach and swimming area! Kayak rentals could be fun when Yunsol is older. The large grassy areas are perfect for running around and playing games."
      }
    }
  ],
  "tips": [
    {
      "id": 1,
      "icon": "🎒",
      "title": "Pack Smart",
      "description": "Always bring snacks, water, extra clothes, and favorite comfort items. A well-packed bag can save the day!"
    },
    {
      "id": 2,
      "icon": "⏰",
      "title": "Time It Right",
      "description": "Plan outings around nap times and meal schedules. Happy, well-rested toddlers make for better adventures!"
    },
    {
      "id": 3,
      "icon": "🛡️",
      "title": "Safety First",
      "description": "Research the venue beforehand, check for toddler-proofing, and always keep a close eye on your little explorer."
    },
    {
      "id": 4,
      "icon": "📋",
      "title": "Have a Backup Plan",
      "description": "Weather changes, meltdowns happen! Always have an indoor alternative or know when it's time to head home."
    }
  ]
}
